b = int(input('Введите первый член геом. прогрессии:')) #первый член геометрической прогрессии
q = int(input('Введите множитель прогрессии ')) #множитель прогрессии
n = int(input('Введите номер последнего элемента ')) #Введите номер последнего элемента
if -10_000 <= b <= 10_000 and 1<= q <= 50 and 2 <= n <= 100: # Задаем ограничения входных данных
    summa = int(b * ((int(q**n)) -1)/(q-1)) #формула суммы геометрической прогрессии
    print(f'Ваша сумма :{summa}') # вывод суммы геометричской прогрессии 
else: 
    print("ошибка")

